# AnalyticalModelBaseExtensionMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelBaseExtensionMethod Property
ParameterTypeId Class See Also
---
"Base Extension Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelBaseExtensionMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelBaseExtensionMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelBaseExtensionMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace